# 扩展访问列表

> 原文:[https://www.geeksforgeeks.org/extended-access-list/](https://www.geeksforgeeks.org/extended-access-list/)

先决条件–[访问控制列表(ACL)](https://www.geeksforgeeks.org/computer-network-access-lists-acl/) 、[标准访问控制列表](https://www.geeksforgeeks.org/computer-network-standard-access-list/)、
访问控制列表(ACL)是为控制网络流量和减少网络攻击而定义的一组规则。ACL 用于根据为网络的传入或传出定义的一组规则来过滤流量。

**扩展访问列表–**
它是访问列表的类型之一，主要用于区分 IP 流量，因此整个流量不会像标准访问列表一样被允许或拒绝。这些是使用源和目标 IP 地址以及端口号来区分 IP 流量的 ACL。在这种类型的 ACL 中，我们还可以提到应该允许还是拒绝哪些 IP 流量。这些使用范围为 100-199 和 2000-2699。

**特色–**

1.  扩展访问列表通常应用于靠近源的地方，但并不总是如此。
2.  在扩展访问列表中，包过滤基于源 IP 地址、目的 IP 地址和端口号进行。
3.  在扩展访问列表中，特定服务将被允许或拒绝。
4.  扩展 ACL 是从 100–199 创建的，扩展范围为 2000–2699。
5.  如果使用带扩展访问列表的编号，那么记住规则不能被删除。如果其中一个规则被删除，那么整个访问列表将被删除。
6.  如果使用扩展访问列表命名，那么我们可以灵活地从访问列表中删除规则。

**配置–**

![](img/43ad7d2a8f6a522d0ab3533a82fb39a7.png)

这是一个小拓扑，其中有 3 个部门，即销售、财务和营销。销售部网络 172.16.10.40/24，财务部网络 172.16.50.0/24，市场部网络 172.16.60.0/24。现在，我们要拒绝从销售部门到财务部门的 FTP 连接，并拒绝从销售和营销部门到财务部门的 telnet 连接。

现在，首先配置编号的扩展访问-用于拒绝从销售部门到财务部门的 FTP 连接的列表。

```
R1# config terminal
R1(config)# access-list 110 
            deny tcp 172.16.40.0 0.0.0.255 172.16.50.0 0.0.0.255 eq 21 
```

在这里，我们首先创建一个编号的访问列表，其中我们使用 110(从扩展的访问列表范围中使用)并拒绝销售网络(172.16.40.0)与财务网络(172.16.50.0)进行 FTP 连接。

**注意–**这里，由于 FTP 使用 TCP 和端口号 21。因此，我们必须根据需要规定许可或拒绝的条件。同样，在 eq 之后，我们必须使用指定应用层协议的端口号。

现在，我们必须拒绝销售和营销部门与财务部的远程登录连接，这意味着任何人都不应该远程登录财务部。为此进行配置。

```
R1(config)# access-list 110 
            deny tcp any 172.16.50.0 0.0.0.255 eq 23
```

这里，我们使用了关键字 any，意思是 0.0.0.0 0.0.0，即来自任何子网掩码的任何 IP 地址。由于 telnet 使用端口号 23，因此我们必须在 eq 之后指定端口号 23。

```
R1(config)# access-list 110 permit ip any any
```

这是最重要的部分。正如我们已经知道的，在每个访问列表的末尾都有一个隐式拒绝，这意味着如果流量不匹配任何访问列表规则，那么流量将被丢弃。

通过指定**任何任何**意味着具有任何 IP 地址流量的源将到达财务部，除非它符合我们制定的上述规则。现在，我们必须在路由器的接口上应用访问列表:

```
R1(config)# int fa0/1
R1(config-if)# ip access-group 110 out
```

我们记得，我们必须在尽可能靠近源的地方应用扩展访问列表，但是在这里我们应用它来靠近目的地，因为我们必须阻止来自销售和营销部门的流量，因此，我们必须在靠近目的地的地方应用它，否则我们必须为 fa0/0 和 fa1/0 入站创建单独的访问列表。

**命名访问列表示例–**

![](img/43ad7d2a8f6a522d0ab3533a82fb39a7.png)

现在，考虑到相同的拓扑，我们将制作一个命名的扩展访问列表。

```
R1(config)# ip access-list extended blockacl
```

通过使用这个命令，我们创建了一个名为 blockacl 的访问列表。

```
R1(config-ext-nacl)# deny tcp 172.16.40.0 0.0.0.255 172.16.50.0 0.0.0.255 eq 21 
R1(config-ext-nacl)# deny tcp any 172.16.50.0 0.0.0.255 eq 23
R1(config-ext-nacl)# permit ip any any
```

然后是我们在编号访问列表中所做的相同配置。

```
R1(config)# int fa0/1
R1(config-if)# ip access-group blockacl out
```