# 标准访问列表

> 原文:[https://www.geeksforgeeks.org/standard-access-list/](https://www.geeksforgeeks.org/standard-access-list/)

先决条件–[访问列表(ACL)](https://www.geeksforgeeks.org/computer-network-access-lists-acl/)
访问列表(ACL)是为控制网络流量和减少网络攻击而定义的一组规则。ACL 用于根据为网络的传入或传出定义的一组规则来过滤流量。

**标准访问列表–**
这些是仅使用源 IP 地址制作的访问列表。这些 ACL 允许或拒绝整个协议组。它们不区分诸如 TCP、UDP、HTTPS 等 IP 流量。通过使用数字 1-99 或 1300-1999，路由器会将其理解为标准 ACL，并将指定地址理解为源 IP 地址。

**特色–**

1.  标准访问列表通常应用于目的地附近(但不总是)。
2.  在标准访问列表中，整个网络或子网都被拒绝。
3.  标准访问列表使用范围 1-99 和扩展范围 1300-1999。
4.  标准访问列表仅使用源 IP 地址实现。
5.  如果使用带有标准访问列表的编号，那么记住规则不能被删除。如果其中一个规则被删除，那么整个访问列表将被删除。
6.  如果使用标准访问列表命名，则可以灵活地从访问列表中删除规则。

**注意–**与扩展访问列表相比，标准访问列表的使用较少，因为整个 IP 协议套件都无法区分不同的 IP 协议流量，因此允许或拒绝流量。

**配置–**

![](img/bd2738670b5b13a788cd2f1b1063ab7c.png)

这是一个小拓扑，其中有 3 个部门，即销售、财务和营销。销售部网络 172.16.40.0/24，财务部网络 172.16.50.0/24，市场部网络 172.16.60.0/24。现在，我想拒绝从销售部门到财务部门的连接，并允许其他人访问该网络。

现在，首先配置编号标准访问列表，用于拒绝从销售部门到财务部门的任何 IP 连接。

```
R1# config terminal
R1(config)# access-list 10 deny 172.16.40.0 0.0.0.255
```

在这里，像扩展访问列表一样，您不能指定允许或拒绝特定的 IP 流量。另外，请注意使用了通配符掩码(0.0.0.255，即子网掩码 255.255.255.0)。从数字标准访问列表范围中使用 10。

```
R1(config)# access-list 110 permit ip any any
```

现在，正如您已经知道的，在每个访问列表的末尾都有一个隐式拒绝，这意味着如果流量与访问列表的任何规则都不匹配，那么流量将被丢弃。
通过指定任何方式，具有任何 IP 地址流量的来源将到达财务部门，除非它符合您制定的上述规则。

现在，您必须在路由器的接口上应用访问列表:

```
R1(config)# int fa0/1
R1(config-if)# ip access-group 10 out
```

请记住，标准访问列表通常应用于目的地，如果您在目的地附近应用访问列表，它将满足我们的需要，因此，出站到接口 fa0/1 已被应用。

**命名标准访问列表示例–**

![](img/bd2738670b5b13a788cd2f1b1063ab7c.png)

现在，考虑到相同的拓扑，您将制作一个命名的标准访问列表。

```
R1(config)# ip access-list standard  blockacl
```

通过使用此命令，您已经创建了一个名为 blockacl 的访问列表。

```
R1(config-std-nacl)# deny 172.16.40.0 0.0.0.255 
R1(config-std-nacl)# permit  any
```

然后在编号访问列表中进行同样的配置。

```
R1(config)# int fa0/1
R1(config-if)# ip access-group blockacl out
```

**远程登录的标准访问列表示例–**
如您所知，您不能在标准访问列表中指定要拒绝的特定 IP 流量，但是可以通过在线路 vty 线路上应用访问列表，使用标准访问列表来允许或拒绝远程登录连接。

![](img/3c2db282d42a13e57257c06e7d519542.png)

在这里，在给定的图中，您想要拒绝从任何网络到财务部的远程登录。配置相同:

```
R1(config)# access-list 10 deny any
R1(config)# line vty 0 4
R1(config-line)# access-class 10 out 
```